# IsValidNamingRule Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PDFExportOptions..::..IsValidNamingRule Method
PDFExportOptions Class See Also
---
Whether naming rule is valid or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static bool IsValidNamingRule(
	IList<TableCellCombinedParameterData> namingRule
)
```

Visual Basic
---
```text
Public Shared Function IsValidNamingRule ( _
	namingRule As IList(Of TableCellCombinedParameterData) _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidNamingRule(
	IList<TableCellCombinedParameterData^>^ namingRule
)
```

# ### Parameters
namingRule
    Type: System.Collections.Generic..::..IList<(Of <(<'TableCellCombinedParameterData>)>)> The naming rule to be validated.
# ### Return Value
Whether or not the name is valid.
# Remarks
If true, this naming rule is a valid. If false, this naming rule is not valid for empty naming rule or illegal characters, such as
CopyC#
```text
\ / : * ? " < > |
```

.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace